Revit 2027 API
Transform2D.Assign Method
 Assigns values from the input transformation to this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Assign(
	Transform2D from
)
Public Sub Assign (
	from As Transform2D
)
public:
void Assign(
	Transform2D^ from
)
member Assign :
        from : Transform2D -> unit
Parameters
from Transform2D
 The transformation to use as input.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace